# dataSet = list(map(lambda x: x.replace(".wakeup_schedule", ""), os.listdir("data")))

import re


def getType(query: str):
    # 使用正则表达式 筛选班级类型
    o = query
    query = query.replace("（中）", "")
    template = re.compile(r'[\u4e00-\u9fa5]+')
    res = template.findall(query)
    if res:
        return res[0]


icons = {'机器人': "机器人", '计': "计算机", '沃尔沃营销': "沃尔沃", '物联网': "物联网", '数控': "数控", '电信': "电信",
         '大众技术': "大众",
         '大众营销': "大众", '时尚表演': "时尚表演", '龙神': "龙神", '航材': "航材", '无人机': "无人机", '美': "美术",
         '军士汽检': "军士汽检",
         '服': "服装", '中车电动': "中车", '福特技术': "福特", '高职电商': "电商", '大众新能源': "大众",
         '大众非技术': "大众", '汽制': "汽车制造",
         '汽电': "汽车电子技术", '用友新道': "用友", '智联': "智联", '机制': "机制", '宝马非技术': "宝马",
         '保时捷技术': "保时捷",
         '宝马营销': "宝马", '北汽技术': "北汽", '旅游': "旅游", '广本机修': "广本", '电商': "电商", '福特营销': "福特",
         '计算机': "计算机",
         '机工': "数控", '广本营销': "广本", '高职应电': "扳手", '财管': "财务管理", '服装': "服装", '航装': "航材",
         '龙神钣喷': "龙神",

         '信息安全': '信息安全', '视传': '视传', '军士机制': '军士机制', '大数据': '大数据', '服设': '服设',
         '飞修': '飞修',
         '军士汽制': '军士汽制', '人力': '人力', '航发': '航发', '数影': '数影', '军士信安': '军士信安', '室内': '室内',
         '北汽': '北汽', '军士网络': '军士网络', '智交': '智交', '新能源': '新能源', '移动互联': '移动互联',
         '服装表演': '服装表演', '网络': '网络', '软件': '软件', '商英': '商英', '车辆职': '车辆职', '电子': '电子',
         '中车焊接': '中车焊接', '宝马技术': '宝马技术', '轮机': '轮机', '陕汽技术': '陕汽技术', '中车': '中车',
         '车改': '车改',
         '通用技术': '通用技术', '数媒': '数媒', '沃尔沃技术': '沃尔沃技术', '高职服装': '高职服装', '工程': '工程',
         '飞制': '飞制', '沃尔沃非技术': '沃尔沃非技术', '会计': '会计', '电气': '电气', '产品': '产品', '美术': '美术',
         '汽智': '汽智', '跨境电商': '跨境电商', '模具': '模具', '汽检': '汽检', '车工': '车工', '风电': '风电',
         '中车工艺': '中车工艺', '电会': '电会', '智控': '智控', '钣喷': '钣喷', '理想': '理想',
         '工业机器人': '工业机器人',
         '汽营': '汽营', '电': '电', '营销': '营销', '机电': '机电', '广本钣喷': '广本钣喷', '国贸': '国贸',
         '福特非技术': '福特非技术'}


def get_icons(name: str):
    name = getType(name)
    return icons.get(name, "其他")
